07_icoTempFoam/testCase/Allrun
blockMesh 2>&1 | tee blockMesh.log
icoTempFoam 2>&1 | tee icoTempFoam.log
